paymentsheet/src/test/resources/elements-sessions-requires_payment_method.json

{
  "business_name": "Mobile Example Account",
  "experiments": {},
  "flags": {},
  "link_settings": {},
  "merchant_country": "US",
  "merchant_currency": "usd",
  "merchant_id": "acct_1HvTI7Lu5o3P18Zp",
  "meta_pay_signed_container_context": null,
  "order": null,
  "ordered_payment_method_types_and_wallets": [PAYMENT_METHOD_TYPES_GO_HERE],
  "payment_method_preference": {
    "object": "payment_method_preference",
    "country_code": "US",
    "ordered_payment_method_types": [PAYMENT_METHOD_TYPES_GO_HERE],
    "payment_intent": {
      "id": "pi_example",
      "object": "payment_intent",
      "amount": 5099,
      "amount_details": {
        "tip": {}
      },
      "automatic_payment_methods": {
        "enabled": true
      },
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "client_secret": "pi_example_secret_example",
      "confirmation_method": "automatic",
      "created": 1674750417,
      "currency": "usd",
      "description": null,
      "last_payment_error": null,
      "livemode": false,
      "next_action": null,
      "payment_method": null,
      "payment_method_options": {
        "us_bank_account": {
          "verification_method": "automatic"
        }
      },
      "payment_method_types": [PAYMENT_METHOD_TYPES_GO_HERE],
      "processing": null,
      "receipt_email": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "status": "requires_payment_method"
    },
    "type": "payment_intent"
  },
  "unactivated_payment_method_types": [],
  "card_brand_choice": {
    "eligible": CBC_ELIGIBLE_HERE
  }
}
